nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507v(c-e)xx-pinctrl.h
/* TIMER7_CH0 */
#define TIMER7_CH0_PC6_INP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)
#define TIMER7_CH0_PC6_OUT \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7_INP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)
#define TIMER7_CH1_PC7_OUT \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8_INP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, NORMP)
#define TIMER7_CH2_PC8_OUT \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9_INP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, NORMP)
#define TIMER7_CH3_PC9_OUT \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER8_NORMP)
#define TIMER8_CH0_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH0_PE5_INP_RMP \
	GD32_PINMUX_AFIO('E', 5, GPIO_IN, TIMER8_RMP)
#define TIMER8_CH0_PE5_OUT_RMP \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, TIMER8_RMP)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER8_NORMP)
#define TIMER8_CH1_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH1_PE6_INP_RMP \
	GD32_PINMUX_AFIO('E', 6, GPIO_IN, TIMER8_RMP)
#define TIMER8_CH1_PE6_OUT_RMP \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, TIMER8_RMP)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8_INP_NORMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, TIMER9_NORMP)
#define TIMER9_CH0_PB8_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER9_NORMP)

/* UART3_RX */
#define UART3_RX_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* UART3_TX */
#define UART3_TX_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_RMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_RMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_RMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_RMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_RMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_RMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_RMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_RMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_RMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_RMP)

/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PB13_PRMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_PRMP)
#define USART2_CTS_PD11_FRMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_FRMP)

/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PB14_PRMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_PRMP)
#define USART2_RTS_PD12_FRMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_FRMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBHS_DM */
#define USBHS_DM_PA11_INP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)
#define USBHS_DM_PA11_OUT \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBHS_DP */
#define USBHS_DP_PA12_INP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)
#define USBHS_DP_PA12_OUT \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBHS_ID */
#define USBHS_ID_PA10_INP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, NORMP)
#define USBHS_ID_PA10_OUT \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBHS_SOF */
#define USBHS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBHS_ULPI_D1 */
#define USBHS_ULPI_D1_PB0_INP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, NORMP)
#define USBHS_ULPI_D1_PB0_OUT \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* USBHS_ULPI_D2 */
#define USBHS_ULPI_D2_PB1_INP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, NORMP)
#define USBHS_ULPI_D2_PB1_OUT \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* USBHS_ULPI_D3 */
#define USBHS_ULPI_D3_PB10_INP \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)
#define USBHS_ULPI_D3_PB10_OUT \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* USBHS_ULPI_D4 */
#define USBHS_ULPI_D4_PB2_INP \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)
#define USBHS_ULPI_D4_PB2_OUT \
	GD32_PINMUX_AFIO('B', 2, ALTERNATE, NORMP)
#define USBHS_ULPI_D4_PB11_INP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)
#define USBHS_ULPI_D4_PB11_OUT \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* USBHS_ULPI_D5 */
#define USBHS_ULPI_D5_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define USBHS_ULPI_D5_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* USBHS_ULPI_D6 */
#define USBHS_ULPI_D6_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define USBHS_ULPI_D6_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* USBHS_ULPI_D7 */
#define USBHS_ULPI_D7_PB5_INP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)
#define USBHS_ULPI_D7_PB5_OUT \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* USBHS_ULPI_DIR */
#define USBHS_ULPI_DIR_PC2 \
	GD32_PINMUX_AFIO('C', 2, GPIO_IN, NORMP)

/* USBHS_ULPI_NXT */
#define USBHS_ULPI_NXT_PC3 \
	GD32_PINMUX_AFIO('C', 3, GPIO_IN, NORMP)

/* USBHS_ULPI_STP */
#define USBHS_ULPI_STP_PC0 \
	GD32_PINMUX_AFIO('C', 0, ALTERNATE, NORMP)

/* USBHS_VBUS */
#define USBHS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, NORMP)

/* WKUP0 */
#define WKUP0_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* WKUP1 */
#define WKUP1_PC13 \
	GD32_PINMUX_AFIO('C', 13, GPIO_IN, NORMP)

/* WKUP2 */
#define WKUP2_PE6 \
	GD32_PINMUX_AFIO('E', 6, GPIO_IN, NORMP)

/* WKUP3 */
#define WKUP3_PA2 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)

/* WKUP4 */
#define WKUP4_PC5 \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, NORMP)

/* WKUP5 */
#define WKUP5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* WKUP6 */
#define WKUP6_PB15 \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
